text/chart_style/tdd_leap_year/tdd_leap_year.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="jp" xml:lang="jp">
<head>
<!-- 2019-10-07 月 11:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>third lesson for ruby novice &#x2013; test --</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Shigeto R. Nishitani" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">third lesson for ruby novice &#x2013; test --</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0cf4553">1. 初めからframe work?</a></li>
<li><a href="#org24658bf">2. テスト駆動の実際</a>
<ul>
<li><a href="#org3826ff8">2.1. お題はうるう年</a></li>
<li><a href="#org8602497">2.2. 2004年はleap year</a></li>
<li><a href="#org4303e78">2.3. 1999はfalse</a></li>
<li><a href="#org5c11f2a">2.4. テストの自動化</a></li>
<li><a href="#orgbadeb75">2.5. 1900はtrue? いえいえfalse</a></li>
<li><a href="#org4877a84">2.6. refactoring 条件式の単純化</a></li>
<li><a href="#org4211a64">2.7. そして2000はtrue！</a></li>
</ul>
</li>
<li><a href="#org64d3232">3. refactoring:methodに</a></li>
<li><a href="#org17a864d">4. caseで</a></li>
<li><a href="#orgea54fae">5. とやり過ぎ</a></li>
<li><a href="#org06c735d">6. もっとすごいtdd</a></li>
<li><a href="#org439a593">7. テストをmain loopに書くこと</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0cf4553" class="outline-2">
<h2 id="org0cf4553"><span class="section-number-2">1</span> 初めからframe work?</h2>
<div class="outline-text-2" id="text-1">
<p>
テストの重要性はある程度認識していると思います.
ただ，巷にあるテキストはTDDのためのframe workを使いなさいとなっていて面倒そうです．
でも本当は，テスト駆動でのcodingは，とっても簡単で便利というのを見てもらいましょう．
</p>
</div>
</div>

<div id="outline-container-org24658bf" class="outline-2">
<h2 id="org24658bf"><span class="section-number-2">2</span> テスト駆動の実際</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org3826ff8" class="outline-3">
<h3 id="org3826ff8"><span class="section-number-3">2.1</span> お題はうるう年</h3>
<div class="outline-text-3" id="text-2-1">
<p>
うるう年の課題ってやったことありますよね．
</p>

<pre class="example">
うるう年(leap year)かどうかを表示するプログラムをかけ．
1. うるう年は4で割り切れる数の年．ただし，
2. 100で割り切れる年はうるう年でなく，
3. 400で割り切れる年はうるう年．
4. 2004, 1999, 1900, 2000で試せ．
5. それぞれtrue, false, false, true
</pre>
<p>
この条件分岐をあらかじめ考えて実装するのってきつくなかったですか？
そいつを順を追って見てもらいましょう．
</p>
</div>
</div>
<div id="outline-container-org8602497" class="outline-3">
<h3 id="org8602497"><span class="section-number-3">2.2</span> 2004年はleap year</h3>
<div class="outline-text-3" id="text-2-2">
<p>
まず4,5は振る舞いを記述する仕様(specification, spec)ではないですよね．例えば，
</p>
<pre class="example">
ruby check_leap_year.rb 2004

</pre>
<p>
とした時に
</p>
<pre class="example">
true

</pre>
<p>
と返ってきてほしいというテストの仕様です．
</p>

<p>
2004年の振る舞いだけを実装すると，
</p>

<div class="org-src-container">
<pre class="src src-ruby">p year = <span style="font-weight: bold; text-decoration: underline;">ARGV</span>[0].to_i
<span style="font-weight: bold;">if</span> year % 4 == 0
  p <span style="font-weight: bold; font-style: italic;">true</span>
<span style="font-weight: bold;">end</span>
</pre>
</div>

<p>
です．これをtestすると
</p>
<pre class="example">
&gt; ruby check_leap_0.rb 2004
2004
true
</pre>
<p>
となります．
</p>
</div>
</div>

<div id="outline-container-org4303e78" class="outline-3">
<h3 id="org4303e78"><span class="section-number-3">2.3</span> 1999はfalse</h3>
<div class="outline-text-3" id="text-2-3">
<p>
次に1999をtestすると
</p>
<pre class="example">
&gt; ruby check_leap_0.rb 1999
1999
</pre>
<p>
です．これをfalseと返すようにすると，
</p>
<div class="org-src-container">
<pre class="src src-ruby">p year = <span style="font-weight: bold; text-decoration: underline;">ARGV</span>[0].to_i
<span style="font-weight: bold;">if</span> year%4 == 0
  p <span style="font-weight: bold; font-style: italic;">true</span>
<span style="font-weight: bold;">else</span>
  p <span style="font-weight: bold; font-style: italic;">false</span>
<span style="font-weight: bold;">end</span>
</pre>
</div>

<p>
ちゃんと返ってます？
</p>
</div>
</div>

<div id="outline-container-org5c11f2a" class="outline-3">
<h3 id="org5c11f2a"><span class="section-number-3">2.4</span> テストの自動化</h3>
<div class="outline-text-3" id="text-2-4">
<p>
この後，さらにテストの内容が増えてくると，
いちいち引数(ARGV[0])で全てチェックするのが面倒になってきそうでしょ．
lazy programmerは二つ以上は耐えられません．
そこで，テストの自動化をします．
</p>

<p>
なに，配列にしてloopで回すだけです．
</p>
<div class="org-src-container">
<pre class="src src-ruby">[2004, 1999].each <span style="font-weight: bold;">do</span> |year|
  p year
  <span style="font-weight: bold;">if</span> year%4 == 0
    p <span style="font-weight: bold; font-style: italic;">true</span>
  <span style="font-weight: bold;">else</span>
    p <span style="font-weight: bold; font-style: italic;">false</span>
  <span style="font-weight: bold;">end</span>
<span style="font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-orgbadeb75" class="outline-3">
<h3 id="orgbadeb75"><span class="section-number-3">2.5</span> 1900はtrue? いえいえfalse</h3>
<div class="outline-text-3" id="text-2-5">
<p>
では次の
</p>
<pre class="example">
100で割り切れる年はうるう年でなく，

</pre>
<p>
ですが，1900はtrueが返って来るのをfalseが返るように変更します．
</p>

<p>
まずはテストの修正
</p>
<div class="org-src-container">
<pre class="src src-ruby">[1900, 2004, 1999].each <span style="font-weight: bold;">do</span> |year|
</pre>
</div>

<p>
次に100で割り切れる場合の処理です．
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="font-weight: bold;">if</span> year%100 == 0
  p <span style="font-weight: bold; font-style: italic;">false</span>
<span style="font-weight: bold;">end</span>
</pre>
</div>
<p>
何ですが，これをどこに入れるかで悩んでしまいます．
とりあえず別処理として前に付け加えておくと，
</p>
<div class="org-src-container">
<pre class="src src-ruby">[1900,2004,1999].each <span style="font-weight: bold;">do</span> |year|
  p year
  <span style="font-weight: bold;">if</span> year % 100 ==0
    p <span style="font-weight: bold; font-style: italic;">false</span>
    <span style="font-weight: bold;">next</span>
  <span style="font-weight: bold;">end</span>
  <span style="font-weight: bold;">if</span> year % 4 == 0
    p <span style="font-weight: bold; font-style: italic;">true</span>
  <span style="font-weight: bold;">else</span>
    p <span style="font-weight: bold; font-style: italic;">false</span>
  <span style="font-weight: bold;">end</span>
<span style="font-weight: bold;">end</span>
</pre>
</div>
<p>
そしてtestです．
</p>
<pre class="example">
bash-3.2$ ruby check_leap_year_19_0.rb 
1900
false
2004
true
1999
false
</pre>
<p>
うまいこと動いていますよね．
</p>
</div>
</div>
<div id="outline-container-org4877a84" class="outline-3">
<h3 id="org4877a84"><span class="section-number-3">2.6</span> refactoring 条件式の単純化</h3>
<div class="outline-text-3" id="text-2-6">
<p>
先ほどの条件式は二つに完全に分けています．
でも，論理的にネスト(入れ子)にする方がいい場合もあります．
</p>
<div class="org-src-container">
<pre class="src src-ruby">[1900,2004,1999].each <span style="font-weight: bold;">do</span> |year|
  p year
  <span style="font-weight: bold;">if</span> year % 100 ==0
    p <span style="font-weight: bold; font-style: italic;">false</span>
  <span style="font-weight: bold;">else</span>
    <span style="font-weight: bold;">if</span> year % 4 == 0
      p <span style="font-weight: bold; font-style: italic;">true</span>
    <span style="font-weight: bold;">else</span>
      p <span style="font-weight: bold; font-style: italic;">false</span>
    <span style="font-weight: bold;">end</span>
  <span style="font-weight: bold;">end</span>
<span style="font-weight: bold;">end</span>
</pre>
</div>
<p>
ですが，ここまでするとif 100 else .. endのelseを省略できることがわかるでしょ．
そうすると，
</p>
<div class="org-src-container">
<pre class="src src-ruby">[1900,2004,1999].each <span style="font-weight: bold;">do</span> |year|
  p year
  <span style="font-weight: bold;">if</span> year % 100 ==0
    p <span style="font-weight: bold; font-style: italic;">false</span>
  <span style="font-weight: bold;">elsif</span> year % 4 == 0
    p <span style="font-weight: bold; font-style: italic;">true</span>
  <span style="font-weight: bold;">else</span>
    p <span style="font-weight: bold; font-style: italic;">false</span>
  <span style="font-weight: bold;">end</span>
<span style="font-weight: bold;">end</span>
</pre>
</div>
<p>
となります．
</p>
</div>
</div>
<div id="outline-container-org4211a64" class="outline-3">
<h3 id="org4211a64"><span class="section-number-3">2.7</span> そして2000はtrue！</h3>
<div class="outline-text-3" id="text-2-7">
<p>
最後の
</p>
<pre class="example">
3. 400で割り切れる年はうるう年．

</pre>
<p>
です．2000年はtrue?
</p>
</div>
</div>
</div>

<div id="outline-container-org64d3232" class="outline-2">
<h2 id="org64d3232"><span class="section-number-2">3</span> refactoring:methodに</h2>
<div class="outline-text-2" id="text-3">
<p>
次はmethodにしたくなりますよね．関数の名前はleap?
としましょう．
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">leap?</span>(year)
  <span style="font-weight: bold;">if</span> year % 400 ==0
    p <span style="font-weight: bold; font-style: italic;">true</span>
  <span style="font-weight: bold;">elsif</span> year % 100 ==0
    p <span style="font-weight: bold; font-style: italic;">false</span>
  <span style="font-weight: bold;">elsif</span> year % 4 == 0
    p <span style="font-weight: bold; font-style: italic;">true</span>
  <span style="font-weight: bold;">else</span>
    p <span style="font-weight: bold; font-style: italic;">false</span>
  <span style="font-weight: bold;">end</span> 
<span style="font-weight: bold;">end</span>
[2000, 1900, 2004, 1999].each <span style="font-weight: bold;">do</span> |year|
  p year
  leap?(year)
<span style="font-weight: bold;">end</span>
</pre>
</div>
<p>
です．true falseを返して，main loopでpする方がいいです．
</p>
</div>
</div>

<div id="outline-container-org17a864d" class="outline-2">
<h2 id="org17a864d"><span class="section-number-2">4</span> caseで</h2>
<div class="outline-text-2" id="text-4">
<p>
ここまででも十分に綺麗なのですが，もっと綺麗にかけます．
caseを使います．
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">leap?</span>(year)
  <span style="font-weight: bold;">case</span> year
  <span style="font-weight: bold;">when</span> % 400 ==0
    p <span style="font-weight: bold; font-style: italic;">true</span>
  <span style="font-weight: bold;">when</span> % 100 ==0
    p <span style="font-weight: bold; font-style: italic;">false</span>
  <span style="font-weight: bold;">when</span> % 4 == 0
    p <span style="font-weight: bold; font-style: italic;">true</span>
  <span style="font-weight: bold;">else</span>
    p <span style="font-weight: bold; font-style: italic;">false</span>
  <span style="font-weight: bold;">end</span>
<span style="font-weight: bold;">end</span>
</pre>
</div>
<p>
when以降には論理値があればいいので，こういう書き方ができます．
嘘です．動きません．
こんななります．
</p>
<pre class="example">
&gt; ruby check_leap_year_19_case_wrong.rb 
2000
false
1900
false
2004
false
1999
false
</pre>
</div>
</div>
<div id="outline-container-orgea54fae" class="outline-2">
<h2 id="orgea54fae"><span class="section-number-2">5</span> とやり過ぎ</h2>
<div class="outline-text-2" id="text-5">
<p>
調子こきました．間違いです．ごめんなさい．
ちゃんと結果見てませんでした．だからgreenが必要です．
これは次のとこで．
</p>

<p>
ちゃんと動くのは，
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">leap?</span>(year)
  <span style="font-weight: bold;">case</span>
  <span style="font-weight: bold;">when</span> year % 400 ==0 ; <span style="font-weight: bold;">return</span> <span style="font-weight: bold; font-style: italic;">true</span>
  <span style="font-weight: bold;">when</span> year % 100 ==0 ; <span style="font-weight: bold;">return</span> <span style="font-weight: bold; font-style: italic;">false</span>
  <span style="font-weight: bold;">when</span> year % 4 ==0 ;   <span style="font-weight: bold;">return</span> <span style="font-weight: bold; font-style: italic;">true</span>
  <span style="font-weight: bold;">else</span> ;                 <span style="font-weight: bold;">return</span> <span style="font-weight: bold; font-style: italic;">false</span>
  <span style="font-weight: bold;">end</span>
<span style="font-weight: bold;">end</span>
</pre>
</div>
<p>
でした．
</p>

<p>
どっかでこういうのを見たことがあるもんやから，
うまくいったと思ってました．ごめんなさい．
</p>
</div>
</div>

<div id="outline-container-org06c735d" class="outline-2">
<h2 id="org06c735d"><span class="section-number-2">6</span> もっとすごいtdd</h2>
<div class="outline-text-2" id="text-6">
<p>
上の知識があると全く逆からのtddも可能です．
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">leap?</span>(year)
  <span style="font-weight: bold;">case</span> 
  <span style="font-weight: bold;">when</span> year == 2000 ; p <span style="font-weight: bold; font-style: italic;">true</span>
  <span style="font-weight: bold;">when</span> year == 1900 ; p <span style="font-weight: bold; font-style: italic;">false</span>
  <span style="font-weight: bold;">when</span> year == 2004 ; p <span style="font-weight: bold; font-style: italic;">true</span>
  <span style="font-weight: bold;">else</span>              ; p <span style="font-weight: bold; font-style: italic;">false</span>
  <span style="font-weight: bold;">end</span>
<span style="font-weight: bold;">end</span>
</pre>
</div>
<p>
ですよね．この後，より一般化して，
</p>
<pre class="example">
2000 -&gt; % 400 == 0

</pre>
<p>
とかにしても問題ありません．
</p>

<p>
さらに，
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">leap?</span>(year)
  <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">case</span>
         <span style="font-weight: bold;">when</span> year % 400 ==0 ; <span style="font-weight: bold; font-style: italic;">true</span>
         <span style="font-weight: bold;">when</span> year % 100 ==0 ; <span style="font-weight: bold; font-style: italic;">false</span>
         <span style="font-weight: bold;">when</span> year % 4 ==0   ; <span style="font-weight: bold; font-style: italic;">true</span>
         <span style="font-weight: bold;">else</span>                ; <span style="font-weight: bold; font-style: italic;">false</span>
         <span style="font-weight: bold;">end</span>
<span style="font-weight: bold;">end</span>
</pre>
</div>
<p>
とするといいかも．これは確認済み．
</p>
</div>
</div>

<div id="outline-container-org439a593" class="outline-2">
<h2 id="org439a593"><span class="section-number-2">7</span> テストをmain loopに書くこと</h2>
<div class="outline-text-2" id="text-7">
<p>
こういう風に，main loopにテストを書くのは正しいのでしょうか？
大学の課題ならいざ知らず，会社でこんなことしていいんでしょうか？
</p>

<p>
いいんですよ．
</p>

<p>
昔は推奨されていたぐらいですから．
leap?関数がどのような振る舞いをするべきかを仕様(spec)として書いておくと，
関数を使う人にも，関数を改良する人にも，関数を探している人にも便利ですよね．
そういう仕様は，どこにおけばいいんでしょう？
関数の置き場所にできるだけ近いところがいいと思いませんか？
なら，main loopでしょ．
</p>

<p>
TDDのバイブルのKent Beck本でもxUnitというのをmain loopに．．
あ，違うな．でも工夫しましょ．
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shigeto R. Nishitani</p>
<p class="date">Created: 2019-10-07 月 11:23</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
